<details><summary>apply for dev-vpc 2024-06-24 15:43:36 (UTC)</summary>
    <details><summary>Locking successful</summary>
  Project diggerhq/demo-ee-features#dev-vpc has been locked by PR #12
</details>

<details ><summary>Apply output</summary>

```terraform
Terraform will perform the following actions:

  # aws_ssm_parameter.foo will be updated in-place
  ~ resource "aws_ssm_parameter" "foo" {
        id              = "/dev/vpc"
      + insecure_value  = (known after apply)
        name            = "/dev/vpc"
        tags            = {}
      ~ value           = (sensitive value)
      ~ version         = 2 -> (known after apply)
        # (8 unchanged attributes hidden)
    }

  # null_resource.test will be created
  + resource "null_resource" "test" {
      + id = (known after apply)
    }

Plan: 1 to add, 1 to change, 0 to destroy.
null_resource.test: Creating...
null_resource.test: Creation complete after 0s [id=80861968120348736]
aws_ssm_parameter.foo: Modifying... [id=/dev/vpc]
aws_ssm_parameter.foo: Modifications complete after 0s [id=/dev/vpc]

Apply complete! Resources: 1 added, 1 changed, 0 destroyed.

```
</details>

</details>